In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine 
from sqlalchemy_utils import database_exists, create_database

# https://hiwony.tistory.com/entry/Dev-log-python-pymysqlerrInterfaceError-0

In [2]:
create_database('mysql+pymysql://root:1234@127.0.0.1:3306/exam')

In [3]:
ex = pd.DataFrame({"날짜": ['2021-01-02', '2021-01-03'], "티커": ['000001', '000001'], "종가":[1340, 1315], "거래량":[1000, 2000]})

ex.head()

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000

In [5]:
engine = create_engine('mysql+pymysql://root:1234@127.0.0.1:3306/exam')
ex.to_sql('price', con = engine, if_exists = 'append', index = False)

In [6]:
pd.read_sql('price', con = engine)

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000

In [7]:
ex = ex.append(pd.DataFrame({"날짜": ['2021-01-03'], "티커": ['000001'],  "종가":[1320], "거래량":[1500]}))

ex.head()

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000
0  2021-01-03  000001  1320  1500

In [8]:
ex.to_sql('price', con = engine, if_exists = 'append', index = False)

pd.read_sql('price', con = engine)

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000
2  2021-01-02  000001  1340  1000
3  2021-01-03  000001  1315  2000
4  2021-01-03  000001  1320  1500

In [129]:
# DB 만들기

con = pymysql.connect(
    user='root', 
    passwd='1234', 
    host='127.0.0.1', 
    db='exam', 
    charset='utf8'
)

mycursor = con.cursor()

In [119]:
ex = pd.DataFrame({"날짜": ['2021-01-02', '2021-01-03'], "티커": ['000001', '000001'], "종가":[1340, 1315], "거래량":[1000, 2000]})
ex = ex.append(pd.DataFrame({"날짜": ['2021-01-04'], "티커": ['000001'],  "종가":[1320], "거래량":[1500]}))
ex.head()

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000
0  2021-01-03  000001  1320  1500

In [120]:
# upsert로 넣기
# 먼저 테이블 만들기

query = f"""
    insert into price_3 (날짜, 티커, 종가, 거래량)
    values (%s,%s,%s,%s) as new
    on duplicate key update
    종가 = new.종가, 거래량 = new.거래량;
"""

args  = ex.values.tolist()

In [121]:
cursor = con.cursor()

mycursor.executemany(query, args)
con.commit()

con.close()

In [130]:
ex = pd.DataFrame({"날짜": ['2021-01-02', '2021-01-03'], "티커": ['000001', '000001'], "종가":[1340, 1315], "거래량":[1000, 2000]})
ex = ex.append(pd.DataFrame({"날짜": ['2021-01-04'], "티커": ['000001'],  "종가":[1320], "거래량":[1500]}))
args  = ex.values.tolist()

args

[['2021-01-02', '000001', 1340, 1000],
 ['2021-01-03', '000001', 1315, 2000],
 ['2021-01-04', '000001', 1320, 1500]]

In [131]:
query = f"""
    insert into price_3 (날짜, 티커, 종가, 거래량)
    values (%s,%s,%s,%s) as new
    on duplicate key update
    종가 = new.종가, 거래량 = new.거래량;
"""

cursor = con.cursor()

mycursor.executemany(query, args)
con.commit()

con.close()